
/*let result = 'number' + 3 + 3;
console.log(result);*/
//Результат: number33
//Відбувається конкатенація стрінгового значення та числового

/*let result = null + 3;
console.log(result);*/
//Результат: 3
//Ми додаємо число 3 до спеціальне значення null (яке нічого не містить та є типом об'єкт)

/*let result = 5 && "qwerty";
console.log(result);*/
// Результат: qwerty
// Відбувається порівння двох значень оскільки 5 = true та qwerty = true. То повертає останній операнд

/*let result = +'40' + +'2' + "hillel";
console.log(result);*/
//Результат: 42hillel
// + перед стрінговим значенням "40" перетворює на числове так само і стрінгове значення "2" на числове. Після чого значення сумуються і відбуваєтсья конкатенація зі стрінговим значення "hillel"

/*let result = '10' - 5 === 6;
console.log(result);*/
//Значення: false
// Ліва сторонна не дорівнює правій. В лівій ми будемо мати  числове значенян 5 оскільки при виконанні коду стрінгове значення 10 буде приведене в числове відповідно викноуєтсья операція різниці і отримуємо в лівій частинні числове значеннння 5, а в правій 6 то буде false

/*let result = true + false;
console.log(result);*/
//Результа: 1
// true = 1 false = 0 додаємо і отримуємо 1

/*let result = '4px' - 3;
console.log(result);*/
//Результат NaN
//Виникає помилка NaN оскільки ліва частина не може бути перетворена в числове значення

/*let result = '4' - 3;
console.log(result);*/
//Результат: 1
//Стрінгове значення з ліва перетворюється (через знак мінус) в числове і відбуваєтсья операція віднімання

/*let result = '6' + 3 ** 0;
console.log(result);*/
//Результат: 61
//Спочатку виконуєтсья піднесення до степеня 0 значення 3 отримуємо 1. Далі оскільки маємо + то відбуваєтсья конкатенація значення 6 та 1

/*let result = 12 / '6';
console.log(result);*/
//Результат: 2
//Стрінгове значення з правої сторони перетворюється(через знак ділення ) в числове і відбуваєтсья операція ділення

/*let result = '10' + (5 === 6);
console.log(result);*/
//Результат: 10false
//Спочатку виконуємо операцію строго порівння  де 5 не дорівнює 6 відповідно отримуємо false після чого відбуваєтсь конкантенація зі значенням '10' false не перетворюєтсья у 0 тому що значення зліва не числове

/*let result = null == '';
console.log(result);*/
//Результат: false
// null це відсутнє значення, а пустий рядок ''це буде 0 тобто значення

/*let result = 3 ** (9 / 3);
console.log(result);*/
//Результат: 27
//Спочатку відбувається операція ділення в дужках, потім відбуваєтсья оперрація приведення до степеня значення 3

/*let result = !!'false' == !!'true';
console.log(result);*/
//Результат: true
// !! це приведня стрінгово до булевого значення  яке дорівнює  true Відповідно з ліва і права буде true    


/*let result = 0 || '0' && 1;
console.log(result);*/
//Результат: 1
//Спочатку виконується операція порівняння && і обидва значення дорівнють true далі йде лише 1. Потім відбувається перехід до операції || (Або)
//І знову всі значення true відповідно як результат отримуємо останнє значення с права 1

/*let result = (+null == false) < 1;
console.log(result);*/
//Результат: false
//+ приводить null до числа 0 далі оскільке не строге порівняння false приводиться також до числа 0 маємо 0 == 0 відповідно буде true
//далі виконуєтсья операція порівняння де true прирівнюєтсья до 1 відповідно маємо 1 < 1  та результат false

/*let result = false && true || true;
console.log(result);*/
//Результат: true
//Спочатку виконується операція порівняння && де перший оперант false відповідно буде результат false. Далі операція || Маємо false || true оскільки перший оперант знову false повертає друге значення true

/*let result = false && (false || true);
console.log(result);*/
//Результат: false
//Спочатку виконуєтсья операція в дужках false || true оскільки перрший операнд false повертає друге значення true. Далі операція порівння false && true перший операнд false повертає його бо значення не співпадають

/*let result = (+null == false) < 1 ** 5;
console.log(result);*/
//Результат: false
// Спочатку операція в дужках (+null == false) + перед null прирівнює до числа 0, оскільки порівння не строге false прирівнюєтсья до 0. В дужках маємо true
// Далі підносими 1 до 5 степені це буде 1. Значення true отримане в душках переводиться в 1 і маємо вираз 1 < 1 що є хибним відповідно false


process.stdin.read();